; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v1)
             (pred_8 ?v6 ?v5)
             (pred_10 ?v9 ?v5)
             (pred_1 ?v13 ?v9 )
	     (pred_3 ?v9)
             (pred_11 ?v12)
             (pred_7 ?v6)
             (pred_4 ?v5)
             (pred_12 ?v9)
             (pred_2 ?v6)
             (pred_6 ?v9)
             (pred_9 ))



(:action op_3
:parameters (?v8 ?v7 ?v10 ?v4)
:precondition (and (pred_11 ?v8) (pred_11 ?v7) (pred_7 ?v10) (pred_4 ?v4)
          (pred_5 ?v8 ?v7) (pred_8 ?v10 ?v4)
                   (pred_10 ?v7 ?v4) (pred_3 ?v8) 
                   (pred_12 ?v7) (pred_2 ?v10))
:effect (and  (pred_6 ?v7) (not (pred_12 ?v7))))


(:action op_2
:parameters (?v8 ?v2)
:precondition (and (pred_11 ?v8) (pred_11 ?v2)
               (pred_3 ?v8) (pred_5 ?v8 ?v2) (pred_6 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v8))))

(:action op_4
:parameters (?v8 ?v10)
:precondition (and (pred_11 ?v8) (pred_7 ?v10) 
                  (pred_3 ?v8) (pred_1 ?v10 ?v8) (pred_9 ))
:effect (and (pred_2 ?v10)
   (not (pred_1 ?v10 ?v8)) (not (pred_9 ))))


(:action op_1
:parameters (?v8 ?v3 ?v11)
:precondition (and (pred_11 ?v8) (pred_7 ?v3) (pred_7 ?v11)
                  (pred_3 ?v8) (pred_2 ?v11) (pred_1 ?v3 ?v8))
:effect (and (pred_2 ?v3) (pred_1 ?v11 ?v8)
        (not (pred_2 ?v11)) (not (pred_1 ?v3 ?v8))))

(:action op_5
:parameters (?v8 ?v10)
:precondition (and (pred_11 ?v8) (pred_7 ?v10) 
                  (pred_3 ?v8) (pred_2 ?v10))
:effect (and (pred_9 ) (pred_1 ?v10 ?v8) (not (pred_2 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_08 obj_29 obj_28 obj_06 obj_02 obj_27 obj_01 obj_04 obj_15 obj_22 obj_31 obj_21 obj_14 obj_07 obj_16 obj_23 obj_20 obj_26 obj_18 obj_10 obj_24 obj_11 obj_17 obj_12
    obj_05 obj_09 obj_03
    obj_19 obj_25 obj_30
    )

    (:init
       (pred_9)

       (pred_11 obj_13)
       (pred_11 obj_08)
       (pred_11 obj_29)
       (pred_11 obj_28)
       (pred_11 obj_06)
       (pred_11 obj_02)
       (pred_11 obj_27)
       (pred_11 obj_01)
       (pred_11 obj_04)
       (pred_11 obj_15)
       (pred_11 obj_22)
       (pred_11 obj_31)
       (pred_11 obj_21)
       (pred_11 obj_14)
       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_11 obj_23)
       (pred_11 obj_20)
       (pred_11 obj_26)
       (pred_11 obj_18)
       (pred_11 obj_10)
       (pred_11 obj_24)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_12)
       (pred_4 obj_05)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_7 obj_19)
       (pred_7 obj_25)
       (pred_7 obj_30)

       (pred_5 obj_13 obj_02)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_08 obj_27)
       (pred_5 obj_08 obj_29)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_29 obj_01)
       (pred_5 obj_29 obj_28)
       (pred_5 obj_29 obj_08)
       (pred_5 obj_28 obj_04)
       (pred_5 obj_28 obj_06)
       (pred_5 obj_28 obj_29)
       (pred_5 obj_06 obj_15)
       (pred_5 obj_06 obj_28)
       (pred_5 obj_02 obj_22)
       (pred_5 obj_02 obj_27)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_27 obj_31)
       (pred_5 obj_27 obj_01)
       (pred_5 obj_27 obj_08)
       (pred_5 obj_27 obj_02)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_01 obj_04)
       (pred_5 obj_01 obj_29)
       (pred_5 obj_01 obj_27)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_15)
       (pred_5 obj_04 obj_28)
       (pred_5 obj_04 obj_01)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_15 obj_06)
       (pred_5 obj_15 obj_04)
       (pred_5 obj_22 obj_16)
       (pred_5 obj_22 obj_31)
       (pred_5 obj_22 obj_02)
       (pred_5 obj_31 obj_23)
       (pred_5 obj_31 obj_21)
       (pred_5 obj_31 obj_27)
       (pred_5 obj_31 obj_22)
       (pred_5 obj_21 obj_20)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_21 obj_01)
       (pred_5 obj_21 obj_31)
       (pred_5 obj_14 obj_26)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_14 obj_21)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_07 obj_14)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_23)
       (pred_5 obj_16 obj_22)
       (pred_5 obj_23 obj_24)
       (pred_5 obj_23 obj_20)
       (pred_5 obj_23 obj_31)
       (pred_5 obj_23 obj_16)
       (pred_5 obj_20 obj_11)
       (pred_5 obj_20 obj_26)
       (pred_5 obj_20 obj_21)
       (pred_5 obj_20 obj_23)
       (pred_5 obj_26 obj_17)
       (pred_5 obj_26 obj_18)
       (pred_5 obj_26 obj_14)
       (pred_5 obj_26 obj_20)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_07)
       (pred_5 obj_18 obj_26)
       (pred_5 obj_10 obj_24)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_24 obj_11)
       (pred_5 obj_24 obj_23)
       (pred_5 obj_24 obj_10)
       (pred_5 obj_11 obj_17)
       (pred_5 obj_11 obj_20)
       (pred_5 obj_11 obj_24)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_26)
       (pred_5 obj_17 obj_11)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_17)
       (pred_12 obj_23)
       (pred_12 obj_04)
       (pred_12 obj_24)
       (pred_10  obj_23 obj_05)
       (pred_10  obj_04 obj_09)
       (pred_10  obj_24 obj_03)
       (pred_6 obj_13)
       (pred_6 obj_08)
       (pred_6 obj_29)
       (pred_6 obj_28)
       (pred_6 obj_06)
       (pred_6 obj_02)
       (pred_6 obj_27)
       (pred_6 obj_01)
       (pred_6 obj_15)
       (pred_6 obj_22)
       (pred_6 obj_31)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_07)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_26)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_6 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_12)

       (pred_8  obj_19 obj_05)
       (pred_8  obj_25 obj_09)
       (pred_8  obj_30 obj_03)
       (pred_1 obj_19 obj_28)
       (pred_1 obj_25 obj_08)
       (pred_1 obj_30 obj_27)
       (pred_3 obj_10)
    )

    (:goal (and
       (pred_1 obj_19 obj_16)
       (pred_1 obj_25 obj_14)
    ))
(:constraints
  (always (not (pred_3 obj_01)))
)
)

; plan
1. (op_2 obj_10 obj_16)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_16)
   goals met: 0 of 2
2. (op_2 obj_16 obj_22)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_22)
   goals met: 0 of 2
3. (op_2 obj_22 obj_31)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_31)
   goals met: 0 of 2
4. (op_2 obj_31 obj_27)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_27)
   goals met: 0 of 2
5. (op_2 obj_27 obj_08)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_08)
   goals met: 0 of 2
6. (op_4 obj_08 obj_25)
   deleted: (pred_1 obj_25 obj_08) (pred_9)
   added: (pred_2 obj_25)
   goals met: 0 of 2
7. (op_2 obj_08 obj_29)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_29)
   goals met: 0 of 2
8. (op_2 obj_29 obj_28)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_28)
   goals met: 0 of 2
9. (op_3 obj_28 obj_04 obj_25 obj_09)
   deleted: (pred_12 obj_04)
   added: (pred_6 obj_04)
   goals met: 0 of 2
10. (op_2 obj_28 obj_04)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_04)
   goals met: 0 of 2
11. (op_2 obj_04 obj_14)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_14)
   goals met: 0 of 2
12. (op_5 obj_14 obj_25)
   deleted: (pred_2 obj_25)
   added: (pred_9) (pred_1 obj_25 obj_14)
   goals met: 1 of 2
13. (op_2 obj_14 obj_04)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_04)
   goals met: 1 of 2
14. (op_2 obj_04 obj_28)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_28)
   goals met: 1 of 2
15. (op_4 obj_28 obj_19)
   deleted: (pred_1 obj_19 obj_28) (pred_9)
   added: (pred_2 obj_19)
   goals met: 1 of 2
16. (op_2 obj_28 obj_29)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_29)
   goals met: 1 of 2
17. (op_2 obj_29 obj_08)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_08)
   goals met: 1 of 2
18. (op_2 obj_08 obj_13)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_13)
   goals met: 1 of 2
19. (op_2 obj_13 obj_02)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_02)
   goals met: 1 of 2
20. (op_2 obj_02 obj_22)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_22)
   goals met: 1 of 2
21. (op_2 obj_22 obj_16)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_16)
   goals met: 1 of 2
22. (op_5 obj_16 obj_19)
   deleted: (pred_2 obj_19)
   added: (pred_9) (pred_1 obj_19 obj_16)
   goals met: 2 of 2
